[M_Iris_RaidPete MissionDefinition]
MissionDescription="Pete has been training since you last faced him.  Get a group of friends and take him down a second time.<br><br>Learn how to trigger the appearance of Pete the Invincible.  Very hard, bring a friend."
TurnInDescription="To fight Pete the Invincible again, go push the button again."

[M_Iris_RaidPete:FindPost MissionObjectiveDefinition]
ProgressMessage="Use raid post to spawn Pete the Invincible"
